Entry~Action~Time~Location~Weather~PhoneFocusMode~DateTime~Device~Steps~HRV~DeviceBattery
Arriving Location~Finished Driving~Jun 12, 2025 at 7:29 PM~1423 Iroquois Pl Ann Arbor MI 48104 United States~73°F and Cloudy~Traveling}~Jun 12, 2025 at 7:29 PM~~~~
Leaving Location~Initiate Driving~Jun 12, 2025 at 7:10 PM~Waters Place Shopping Center 3160 Lohr Rd Ann Arbor MI 48108 United States~74°F and Cloudy~Do Not Disturb}~Jun 12, 2025 at 7:10 PM~~~~
Arriving Location~Finished Driving~Jun 12, 2025 at 6:40 PM~2509 Country Village Ct Ann Arbor MI 48103 United States~75°F and Cloudy~Traveling}~Jun 12, 2025 at 6:40 PM~~~~
Leaving Location~Initiate Driving~Jun 12, 2025 at 6:38 PM~2509 Country Village Ct Ann Arbor MI 48103 United States~75°F and Cloudy~}~Jun 12, 2025 at 6:38 PM~~~~
{ Entry: Got a cat stand for Wilson, so now they don’t complaint!   Chase acct 4915: Your $148.38 debit card transaction with LS WAGS TO WISKERS on Jun 12, 2025 at 1:06 PM ET was more than the $20.00 in your Alerts settings., Time: Jun 12, 2025 at 2:02 PM, Location:2509 Country Village Ct Ann Arbor MI 48103 United States, Weather:76°F and Mostly Cloudy, Phone Focus Mode: Normal, Device: iPhone, Steps: 579, HRV: , Device Battery: 49% }~~Jun 12, 2025 at 2:02 PM~~~~~~~~
{ Entry: Just coming back from Pilar’s tamales and had a fun chat with Sylvia and Espe about the current revolution in writing that’s going on right now, as our country falls into this madness.   Also, Sylvia had this bad ass claw earring that I had to take a picture of   , Time: Jun 12, 2025 at 1:54 PM, Location:2509 Country Village Ct Ann Arbor MI 48103 United States, Weather:76°F and Mostly Cloudy, Phone Focus Mode: Normal, Device: iPhone, Steps: 579, HRV: , Device Battery: 52% }~~Jun 12, 2025 at 1:54 PM~~~~~~~~
Arriving Location~Finished Driving~Jun 12, 2025 at 1:54 PM~2509 Country Village Ct Ann Arbor MI 48103 United States~76°F and Mostly Cloudy~Traveling}~Jun 12, 2025 at 1:54 PM~~~~
Leaving Location~Initiate Driving~Jun 12, 2025 at 1:50 PM~2507 Adrienne Dr Ann Arbor MI 48103 United States~76°F and Mostly Cloudy~Traveling}~Jun 12, 2025 at 1:50 PM~~~~
Arriving Location~Finished Driving~Jun 12, 2025 at 1:15 PM~2507 Adrienne Dr Ann Arbor MI 48103 United States~75°F and Cloudy~Traveling}~Jun 12, 2025 at 1:15 PM~~~~
Leaving Location~Initiate Driving~Jun 12, 2025 at 1:13 PM~2395 Jackson Ave Ann Arbor MI 48103 United States~75°F and Mostly Cloudy~Traveling}~Jun 12, 2025 at 1:13 PM~~~~
Arriving Location~Finished Driving~Jun 12, 2025 at 1:12 PM~2395 Jackson Ave Ann Arbor MI 48103 United States~75°F and Mostly Cloudy~Traveling}~Jun 12, 2025 at 1:12 PM~~~~
Leaving Location~Initiate Driving~Jun 12, 2025 at 1:09 PM~2395 Jackson Ave Ann Arbor MI 48103 United States~74°F and Mostly Cloudy~}~Jun 12, 2025 at 1:09 PM~~~~
Arriving Location~Finished Driving~Jun 12, 2025 at 1:03 PM~2395 Jackson Ave Ann Arbor MI 48103 United States~74°F and Mostly Cloudy~Traveling}~Jun 12, 2025 at 1:03 PM~~~~
Leaving Location~Initiate Driving~Jun 12, 2025 at 12:57 PM~2509 Country Village Ct Ann Arbor MI 48103 United States~74°F and Mostly Cloudy~}~Jun 12, 2025 at 12:57 PM~~~~
{ Entry: Spent the last two hours or so playing with shortcuts iOS integration with ChatGPT and I have converted my journaling app to make sure that the automation works.   And it does, because when I was running it, compiling my magic market analysis shortcut it was able to run the automation without me having to be on the phone.   This is huge for my nighttime automation in my morning time news article. Now I can do a very easy morning digest., Time: Jun 12, 2025 at 3:58 AM, Location:2509 Country Village Ct Ann Arbor MI 48103 United States, Weather:63°F and Mostly Cloudy, Phone Focus Mode: Sleep, Device: iPhone, Steps: 70, HRV: , Device Battery: 12% }~~Jun 12, 2025 at 3:58 AM~~~~~~~~
{Entry: It is 12:19 and I’m heading to Pillar’s (6 dollars, Horchata, espresso. to get some coffee! Then Poke Fish for poke fish bowls and miso soup. 17 dollars or so!. :)  I’m awake! Washed my hair with baking soda, and now I’m logging while in the bathroom.   Let’s get it!  Time: May 2, 2025 at 12:21 PM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:60°F and Cloudy Phone Focus Mode: Personal}~~May 2, 2025 at 12:21 PM~~~~~~~~
{Entry: Spent the last 2 hours working on TRMNL…. API, to refresh the epaper display thingy. Lmao.  Time for bed! I’m so tired. But hey, at least I got the thingy to work with my shortcuts!  Time: May 2, 2025 at 4:26 AM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:54°F and Mostly Cloudy Phone Focus Mode: Sleep}~~May 2, 2025 at 4:26 AM~~~~~~~~
{Entry: Time for bed. I think I played like the six hours of this game today. Expedition 33 lmao.   Time for bed. Overall, good day.  Time: May 2, 2025 at 2:52 AM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:55°F and Cloudy Phone Focus Mode: Sleep}~~May 2, 2025 at 2:52 AM~~~~~~~~
{Entry: Playing expedition 33 and fluffy is laying right next to me as well as Wilson is really cute and looks so freaking cute. Today I am very proud of cleaning my table. My kitchen table is finally really freaking clean.  I’m also really proud of my own creation up the shortcuts for a AI pen replacement so that I don’t really need something like that.  And I’m also really proud of the fact that I did work today.  Oh and I paid my bill so now I am completely broke because I only have like $100 in my bank account right now. My mom feels really bad that she cannot pay for my bills so I had to pause my 401(k) for a little bit, but that’s OK. I’ve spent about 16 hours playing expedition 33. And it is worth it so much.  Overall, a pretty good day!  Time: May 1, 2025 at 11:07 PM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:60°F and Mostly Cloudy Phone Focus Mode: }~~May 1, 2025 at 11:07 PM~~~~~~~~
"{Entry: {""date"":""May 1, 2025"",""book_title"":""Notes to John"",""highlights"":""“The value of those programs isn’t in what you learn or don’t learn about alcoholism, although that’s what they tell you,” he said. “The value is in the statement. You’re telling the child by your presence not just that you take the problem seriously – you already made that statement, by taking her there – but that you take this specific solution seriously. You’re in effect legitimizing it. That can be very meaningful to someone who has looked to you for cues her entire life.”\n\nExcerpt From\nNotes to John\nJoan Didion\nThis material may be protected by copyright."",""author"":""Joan Didion"",""location"":""Home"",""time"":""9:43 PM""} Time: May 1, 2025 at 9:43 PM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:62°F and Cloudy Phone Focus Mode: Do Not Disturb}"~~May 1, 2025 at 9:43 PM~~~~~~~~
{Entry: Hmmmmmm. Okay I am officially finished with this little shortcut for journal processing. I think there are better improvements but for now I think it’s very good.   Time to go do some reading!  Time: May 1, 2025 at 9:29 PM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:62°F and Cloudy Phone Focus Mode: Do Not Disturb}~~May 1, 2025 at 9:29 PM~~~~~~~~
{Entry: Here are all the places I’ve been to today. Update the post with these locations too.   Timeline  Day | Trips | Insights | Places | Cities | World  Today  6 mi | 67 min | 4 visits  Home (2551 Country Village Ct) 2551 Country Village Ct, Ann Arbor, MI 48103 Left at 12:35 PM  Driving 0.9 mi | 2 min 12:38 PM – 12:40 PM  Tienda La Libertad 2231 West Liberty St, 2231 W Liberty St, Ann Arbor, MI 48103 Arrived at 12:41 PM  Missing travel 1 mi | 3 min 12:48 PM – 12:51 PM Add travel  Home (2551 Country Village Ct) 2551 Country Village Ct, Ann Arbor, MI 48103 Arrived at 12:56 PM  Driving 5.3 mi | 16 min 4:13 PM – 4:29 PM  Poke Fish Sushi 3500 Washtenaw Ave E-4, Ann Arbor, MI 48104 Arrived at 4:30 PM  Driving 436 ft | 39 min 5:09 PM – 5:48 PM Time: May 1, 2025 at 9:24 PM Location:2509 Country Village Ct Ann Arbor MI 48103 United States Weather:62°F and Cloudy Phone Focus Mode: Do Not Disturb}~~May 1, 2025 at 9:24 PM~~~~~~~~
{Entry: Holy shit I had a day so I had the pleasure of getting a spider plant from Sylvia this morning that was really cool. I named the plant August Saint Augustine because Sylvia's Catholic and I just want to kind of like Sylvia's cat not cat and I just want to make sure that it works 